The  FilteredWorksetIterator  type exposes the following members.
 Properties
Name  |   Description
Current
CurrentObject
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 See Also
  FilteredWorksetIterator Class
  Autodesk.Revit.DB Namespace